package JavaUp7;

public class JavaUP_readNum {
	
	public static String convert(String number) {
		// #숫자 한글로 읽기
		String[] kp5_num1= {"","일","이","삼","사","오","육","칠","팔","구"};
		String[] kp5_num2= {"","십","백","천"};
		String[] kp5_num3= {"","만","억","조"};
		
		StringBuffer kp5_result = new StringBuffer();
		int kp5_length = number.length(); //
		int kp5_inInt = 0;
		
		for(int i = kp5_length-1; i >=0; i--) {
			kp5_inInt = Integer.parseInt(String.valueOf(number.charAt(kp5_length-i-1)));
			
			if(kp5_inInt > 0) {
				kp5_result.append(kp5_num1[kp5_inInt]);
				kp5_result.append(kp5_num2[i%4]); //십,백,천
			}
			if(i%4==0) {
				kp5_result.append(kp5_num3[i/4]); //천단위
			}
		}
		return kp5_result.toString();
	}
	public static void main(String[] args) {
		// TODO Auto-generated method stub
		//csv파일을 다운받아 배열에 생성 후 넣음
		String [] kp5_OneRec = {
				"시도명,시군구명,자치단체코드,과세년도,세목명,과세건수,과세금액,비과세건수,비과세금액",
				"경기도,안양시만안구,41171,2017,취득세,26510,81484385000,8444,15733409000",
				"경기도,안양시만안구,41171,2017,주민세,109413,4673686000,7405,62678000",
				"경기도,안양시만안구,41171,2017,교육세,446396,22337198000,5,1000",
				"경기도,안양시만안구,41171,2017,지방소득세,66441,32972907000,5,1000",
				"경기도,안양시만안구,41171,2017,지역자원시설세,136361,3923015000,5014,514325000",
				"경기도,안양시만안구,41171,2017,등록면허세,61190,5664999000,761,262332000",
				"경기도,안양시만안구,41171,2017,담배소비세,107,12997622000,0,0",
				"경기도,안양시만안구,41171,2017,자동차세,138759,41444892000,18863,1076280000",
				"경기도,안양시만안구,41171,2017,재산세,108378,39671781000,20285,21944527000",
				"경기도,안양시동안구,41173,2017,지방소득세,135297,90509846000,0,0",
				"경기도,안양시동안구,41173,2017,지역자원시설세,230287,10027306000,4021,653780000",
				"경기도,안양시동안구,41173,2017,등록면허세,98612,10240846000,822,441106000",
				"경기도,안양시동안구,41173,2017,교육세,661602,37528423000,1,0",
				"경기도,안양시동안구,41173,2017,자동차세,198066,66593232000,17464,1053651000",
				"경기도,안양시동안구,41173,2017,재산세,173049,74628695000,28004,37043601000",
				"경기도,안양시동안구,41173,2017,주민세,147318,11633124000,8353,44873000",
				"경기도,안양시동안구,41173,2017,담배소비세,109,19496471000,0,0",
				"경기도,안양시만안구,41171,2018,취득세,25173,69049666000,9165,17028094000",
				"경기도,안양시만안구,41171,2018,주민세,110588,4985083000,9565,65114000",
				"경기도,안양시만안구,41171,2018,교육세,450545,21673553000,16,3000",
				"경기도,안양시만안구,41171,2018,지방소득세,73200,36026700000,0,0"
		};
		
		String[] k5_field_name = kp5_OneRec[0].split(","); //배열의 첫번째(항목이름)을 ,로 나눔
		for(int kp5_i = 1; kp5_i < kp5_OneRec.length; kp5_i++) { //배열 길이만큼 출력
			String[] field = kp5_OneRec[kp5_i].split(","); //배열의 항목부분을 ,로 나눔
			System.out.println("**********************************************");
			
			for(int j = 0; j<k5_field_name.length-4; j++) {
				System.out.printf("%s : %s\n",k5_field_name[j],field[j]);
			}
			for(int j = 6; j<k5_field_name.length; j++) {
				System.out.printf("%s : %s\n",k5_field_name[j],JavaUP_readNum.convert(field[j]));
			}
			System.out.println("**********************************************");
		}
	}
}
